tap "aws/tap"
tap "beeftornado/rmtree"
tap "cjbassi/ytop"
tap "getantibody/tap"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "martido/graph"
tap "mas-cli/tap"
tap "vitorgalvao/tiny-scripts"
tap "xwmx/taps"
# MPEG-4 command-line tool
brew "atomicparsley"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# New way to see and navigate directory trees
brew "broot"
# Like cat but displays content with syntax highlighting
brew "ccat"
# Cross-platform make
brew "cmake"
# Dependency Manager for PHP
brew "composer"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Tool for exploring each layer in a docker image
brew "dive"
# Command-line DNS client
brew "dog"
# More intuitive version of du in rust
brew "dust"
# Modern replacement for 'ls'
brew "exa"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Identify or delete duplicate files
brew "fdupes"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# CLI program that accepts piped input and presents files for selection
brew "fpp"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Alternative to top/htop
brew "glances"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg", link: false
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Curl statistics made simple
brew "httpstat"
# Add GitHub support to git on the command-line
brew "hub"
# Configurable static site generator
brew "hugo"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Prints information and tests integrity of JPEG/JFIF files
brew "jpeginfo"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Pager program similar to more
brew "less"
# Audio and video processing tools
brew "libav"
# Utility to list open files
brew "lsof", link: true
# Package manager for the Lua programming language
brew "luarocks"
# Swiss Army Knife for macOS
brew "m-cli"
# Drop-in replacement for MySQL
brew "mariadb"
# Mac App Store command-line interface
brew "mas"
# Unified display of technical and tag data for audio/video
brew "media-info"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Tiny, lightning fast, feature-packed file manager
brew "nnn"
# Platform built on V8 to build network applications
brew "node"
# Swiss-army knife of markup format conversion
brew "pandoc"
# General-purpose scripting language
brew "php"
# Modern replacement for ps written by Rust
brew "procs"
# Coreutils progress viewer
brew "progress"
# Rsync for cloud storage
brew "rclone"
# Utility that provides fast incremental file transfer
brew "rsync"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Penetration testing for SQL injection and database servers
brew "sqlmap"
# Library to search and download subtitles
brew "subliminal"
# Code-search similar to ack
brew "the_silver_searcher"
# Simplified and community-driven man pages
brew "tldr"
# Program that allows you to count code, quickly
brew "tokei"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Command-line interface for WordPress
brew "wp-cli"
# Yet Another Dotfiles Manager
brew "yadm"
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# AWS SAM CLI 🐿 is a tool for local development and testing of Serverless applications
brew "aws/tap/aws-sam-cli"
brew "beeftornado/rmtree/brew-rmtree"
# A TUI system monitor written in Rust
brew "cjbassi/ytop/ytop"
# The fastest shell plugin manager
brew "getantibody/tap/antibody"
# Quickly repair outdated/broken Casks from homebrew-cask
brew "vitorgalvao/tiny-scripts/cask-repair"
brew "xwmx/taps/nb"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Utility to set up alt-tab to switch between windows
cask "alt-tab"
# Application uninstaller
cask "appcleaner"
# Data backup and storage service
cask "backblaze"
cask "background-music"
# Prevents audio balance from drifting left or right
cask "balance-lock"
# Free and open-source 3D creation suite
cask "blender"
# Volume booster and equalizer software
cask "boom-3d"
# Web browser focusing on privacy
cask "brave-browser"
# E-books management software
cask "calibre"
# Tool to list all active shortcuts of the current application
cask "cheatsheet"
# Downloads videos and audio from websites
cask "clipgrab"
# Tool to show live information about the batteries in various devices
cask "coconutbattery"
# Multi-platform client-side cloud file encryption tool
cask "cryptomator"
# Server and cloud storage browser
cask "cyberduck"
# Utility to enhance the Open and Save dialogs in applications
cask "default-folder-x"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Tool to rename digital photos, movie- and audio-clips
cask "exifrenamer"
# Calendar software
cask "fantastical"
# File finder
cask "find-any-file"
# Web browser
cask "firefox"
# Web browser
cask "firefox-developer-edition"
cask "fliqlo"
# Screen color temperature controller
cask "flux"
cask "font-fira-code"
cask "font-hack"
cask "font-ia-writer-quattro"
cask "font-ibm-plex"
cask "font-inter"
# Sans-serif, slab-serif, monospace and quasi‑proportional typeface family
cask "font-iosevka"
# Sans-serif, slab-serif, monospace and quasi‑proportional typeface family
cask "font-iosevka-aile"
# Typeface made for developers
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
# Font manager
cask "fontbase"
# GIT client
cask "fork"
# Finder replacement and FTP, SFTP, WebDAV and Amazon s3 client
cask "forklift"
# Tool to measure the computer system's performance
cask "geekbench"
cask "gfxcardstatus"
# Game client
cask "gog-galaxy"
# Web browser
cask "google-chrome"
# Web browser
cask "google-chrome-dev"
# Tools to protect your emails and files
cask "gpg-suite"
# Open-source video transcoder
cask "handbrake"
# Free and open-source media player
cask "iina"
# Tool to optimize images to a smaller size
cask "imageoptim"
cask "intel-power-gadget"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customizer
cask "karabiner-elements"
# File archiver
cask "keka"
# Automation software
cask "keyboard-maestro"
# Interface for reading and syncing eBooks
cask "kindle"
# Animated screen capture application
cask "licecap"
# Host-based application firewall
cask "little-snitch"
# WordPress local development tool by Flywheel
cask "local"
# Controls and monitors all fans on Apple computers
cask "macs-fan-control"
# Visual diff and merge tool
cask "meld"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Resize and reposition apps
cask "mosaic"
# VPN client
cask "mullvadvpn"
# Music tagger
cask "musicbrainz-picard"
# Visual tool to design, develop and administer MySQL servers
cask "mysqlworkbench"
# Utility to toggle dark mode
cask "nightowl"
# App to write, plan, collaborate, and get organized
cask "notion"
# Open-source software for live streaming and screen recording
cask "obs"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Finds large, unwanted files and deletes them
cask "omnidisksweeper"
# File system integration
cask "osxfuse"
# Collaboration platform for API development
cask "postman"
# Graphical user interface for the 'defaults' command
cask "prefs-editor"
# Web development companion
cask "prepros"
# Peer to peer Bitorrent client
cask "qbittorrent"
# QuickLook plug-in that renders source code with syntax highlighting
cask "qlcolorcode"
# Display image info and preview unsupported formats in QuickLook
cask "qlimagesize"
# QuickLook generator for Markdown files
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-csv"
cask "quicklookase"
cask "rcdefaultapp"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# JavaScript playground that auto-evaluates as code is typed
cask "runjs"
# MySQL/MariaDB database management platform
cask "sequel-pro"
# Instant messaging application focusing on security
cask "signal"
# Video chat, voice call and instant messaging application
cask "skype"
# Team communication and collaboration software
cask "slack"
# Displays all open files and sockets in use by all running processes
cask "sloth"
# Move and resize windows with ease
cask "spectacle"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Git client
cask "sublime-merge"
# Text editor for code, markup and prose
cask "sublime-text"
# Subtitle speech synchronizer
cask "subsync"
# Real time file synchronization software
cask "syncthing"
# Native GUI tool for relational databases
cask "tableplus"
# Messaging app with a focus on speed and security
cask "telegram"
# Utility to change the default backup interval of Time Machine
cask "timemachineeditor"
# Web browser focusing on security
cask "tor-browser"
cask "tower2"
# Open-source BitTorrent client
cask "transmission"
# Tool to automate the insertion of frequently used text and graphics
cask "typinator"
# Configurable document editor that supports Markdown
cask "typora"
# Free and open-source hosted hypervisor for x86 virtualization
cask "virtualbox"
# Open-source code editor
cask "visual-studio-code"
# Code editor
cask "visual-studio-code-insiders"
# Multimedia player
cask "vlc"
# Network protocol analyzer
cask "wireshark"
mas "Affinity Designer", id: 824171161
mas "Affinity Photo", id: 824183456
mas "Amphetamine", id: 937984704
mas "Baby Monitor 3G", id: 626137367
mas "Bear", id: 1091189122
mas "Black Out", id: 1319884285
mas "Clean Text Menu", id: 1222295315
mas "Dato", id: 1470584107
mas "Day One", id: 1055511498
mas "Gifski", id: 1351639930
mas "Glance", id: 1513574319
mas "GoPro Player", id: 1460836908
mas "HazeOver", id: 430798174
mas "Irvue", id: 1039633667
mas "Jiffy", id: 1502527999
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pocket", id: 568494494
mas "Reeder", id: 880001334
mas "Spark", id: 1176895641
mas "Tadam", id: 531349534
mas "Todoist", id: 585829637
mas "Unsplash Wallpapers", id: 1284863847
mas "WiFi Signal", id: 525912054
mas "Xcode", id: 497799835
mas "Yoink", id: 457622435
