tap "beeftornado/rmtree"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-eid"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "martido/brew-graph"
tap "mas-cli/tap"
tap "vitorgalvao/tiny-scripts"
brew "bat"
brew "python"
brew "ccat"
brew "composer"
brew "coreutils"
brew "curl"
brew "diff-so-fancy"
brew "dnsmasq", restart_service: true
brew "enca"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "git"
brew "glances"
brew "gnu-tar"
brew "gnupg", link: false
brew "go"
brew "gource"
brew "graphviz"
brew "htop"
brew "httpie"
brew "hub"
brew "hugo"
brew "imagemagick"
brew "jpeginfo"
brew "jrnl"
brew "lazygit"
brew "less"
brew "libav"
brew "lighttpd"
brew "lsof"
brew "m-cli"
brew "mariadb"
brew "mas"
brew "media-info"
brew "moreutils"
brew "nginx", restart_service: true
brew "nmap"
brew "nnn"
brew "node"
brew "pandoc"
brew "php", restart_service: true
brew "php-code-sniffer"
brew "pngquant"
brew "progress"
brew "shellcheck"
brew "speedtest-cli"
brew "sqlmap"
brew "subliminal"
brew "the_silver_searcher"
brew "tldr"
brew "trash"
brew "tree"
brew "vim"
brew "watchman"
brew "webtorrent-cli"
brew "wget"
brew "wpscan"
brew "yarn"
brew "youtube-dl"
brew "z"
brew "zsh-syntax-highlighting"
brew "beeftornado/rmtree/brew-rmtree"
brew "martido/brew-graph/brew-graph"
brew "vitorgalvao/tiny-scripts/cask-repair"
cask "anki"
cask "appcleaner"
cask "blender"
cask "brave"
cask "calibre"
cask "cheatsheet"
cask "clipgrab"
cask "coconutbattery"
cask "cryptomator"
cask "cyberduck"
cask "docker"
cask "dozer"
cask "exifrenamer"
cask "figma"
cask "find-any-file"
cask "firefox"
cask "fliqlo"
cask "flux"
cask "forklift"
cask "franz"
cask "google-chrome-canary"
cask "gpg-suite"
cask "graphiql"
cask "handbrake"
cask "hyper"
cask "iina"
cask "imageoptim"
cask "imazing"
cask "iterm2"
cask "karabiner-elements"
cask "keepingyouawake"
cask "keka"
cask "krisp"
cask "lepton"
cask "licecap"
cask "musicbrainz-picard"
cask "notable"
cask "numi"
cask "onionshare"
cask "osxfuse"
cask "prefs-editor"
cask "qbittorrent"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-csv"
cask "quicklook-json"
cask "quicklookase"
cask "rcdefaultapp"
cask "sequel-pro"
cask "signal"
cask "skype"
cask "sloth"
cask "soulseek"
cask "spectacle"
cask "spectrum"
cask "stand"
cask "steam"
cask "subler"
cask "sublime-merge"
cask "tor-browser"
cask "transmission"
cask "tribler"
cask "vagrant"
cask "vagrant-manager"
cask "veracrypt"
cask "viber"
cask "virtualbox"
cask "visual-studio-code"
cask "vox"
cask "wineskin-winery"
cask "wireshark"
cask "xact"
cask "xquartz"
mas "AudioBookBinder", id: 413969927
mas "Bear", id: 1091189122
mas "Clean Text Menu", id: 1222295315
mas "GIPHY CAPTURE", id: 668208984
mas "HazeOver", id: 430798174
mas "iMovie", id: 408981434
mas "Irvue", id: 1039633667
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Reeder", id: 880001334
mas "Spark", id: 1176895641
mas "Todoist", id: 585829637
mas "Xcode", id: 497799835
