tap "beeftornado/rmtree"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "jesseduffield/lazynpm"
tap "martido/graph"
tap "romkatv/powerlevel10k"
tap "saulpw/vd"
tap "xwmx/taps"
# Plugin manager for zsh, inspired by antigen and antibody
brew "antidote"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Cross-platform make
brew "cmake"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Library for encoding and decoding .avif files
brew "libavif"
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Top-like interface for container metrics
brew "ctop"
# Open source multi-tool for exploring and publishing data
brew "datasette"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Tool for exploring each layer in a docker image
brew "dive"
# Command-line DNS client
brew "dog"
# More intuitive version of du in rust
brew "dust"
# Run arbitrary commands when files change
brew "entr"
# Modern replacement for 'ls'
brew "exa"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Identify or delete duplicate files
brew "fdupes"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Fast and simple Node.js version manager
brew "fnm"
# CLI program that accepts piped input and presents files for selection
brew "fpp"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Alternative to top/htop
brew "glances"
# GNU version of the tar archiving utility
brew "gnu-tar"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Make JSON greppable
brew "gron"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Curl statistics made simple
brew "httpstat"
# Add GitHub support to git on the command-line
brew "hub"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Pager program similar to more
brew "less"
# Package manager for the Lua programming language
brew "luarocks"
# Swiss Army Knife for macOS
brew "m-cli"
# Mac App Store command-line interface
brew "mas"
# Modern and intuitive terminal-based text editor
brew "micro"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Port scanning utility for large networks
brew "nmap"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Command-line and local web note‑taking, bookmarking, and archiving
brew "nb"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Tiny, lightning fast, feature-packed file manager
brew "nnn"
# Platform built on V8 to build network applications
brew "node"
# 📦🚀 Fast, disk space efficient package manager
brew "pnpm"
# Object-relational database system
brew "postgresql@14"
# Modern replacement for ps written by Rust
brew "procs"
# Coreutils progress viewer
brew "progress"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Rsync for cloud storage
brew "rclone"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Utility that provides fast incremental file transfer
brew "rsync"
# Safe, concurrent, practical language
brew "rust"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Penetration testing for SQL injection and database servers
brew "sqlmap"
# Code-search similar to ack
brew "the_silver_searcher"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Program that allows you to count code, quickly
brew "tokei"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Command-line interface for WordPress
brew "wp-cli"
# Yet Another Dotfiles Manager
brew "yadm"
# JavaScript package manager
brew "yarn"
# Fork of youtube-dl with additional features and fixes
brew "yt-dlp"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
brew "beeftornado/rmtree/brew-rmtree"
# A simple terminal UI for git commands, written in Go
brew "jesseduffield/lazynpm/lazynpm"
# A Zsh Theme
brew "romkatv/powerlevel10k/powerlevel10k"
# Terminal utility for exploring and arranging tabular data
brew "saulpw/vd/visidata"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Collection of apps and services for photography, design, video, web, and UX
cask "adobe-creative-cloud"
# GPU-accelerated terminal emulator
cask "alacritty"
# Menu bar tool to limit maximum charging percentage
cask "aldente"
# Application launcher and productivity software
cask "alfred"
# Enable Windows-like alt-tab
cask "alt-tab"
# Application uninstaller
cask "appcleaner"
# Prevents audio balance from drifting left or right
cask "balance-lock"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Menu bar icon organizer
cask "bartender"
# Display management tool
cask "betterdisplay"
# Utility improving 3rd party mouse performance and functionalities
cask "bettermouse"
# Tool to customize input devices and automate computer systems
cask "bettertouchtool"
# 3D creation suite
cask "blender"
# Prevents your sleeping computer from connecting to Bluetooth accessories
cask "bluesnooze"
# Volume booster and equalizer software
cask "boom-3d"
# Scriptable scratchpad for developers
cask "boop"
# E-books management software
cask "calibre"
# Tool to list all active shortcuts of the current application
cask "cheatsheet"
# Screen capturing tool
cask "cleanshot"
# Downloads videos and audio from websites
cask "clipgrab"
# Tool to show live information about the batteries in various devices
cask "coconutbattery"
# Multi-platform client-side cloud file encryption tool
cask "cryptomator"
# Server and cloud storage browser
cask "cyberduck"
# Disk space visualizer
cask "daisydisk"
# Universal database tool and SQL client
cask "dbeaver-community"
# Utility to enhance the Open and Save dialogs in applications
cask "default-folder-x"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Tool to rename digital photos, movie- and audio-clips
cask "exifrenamer"
# Reimagine your terminal
cask "fig"
# Collaborative team software
cask "figma"
# File finder
cask "find-any-file"
# Web browser
cask "firefox"
# Web browser
cask "firefox-developer-edition"
# Flip clock screensaver
cask "fliqlo"
# Screen color temperature controller
cask "flux"
cask "font-ia-writer-quattro"
# Corporate typeface for IBM
cask "font-ibm-plex"
# Sans-serif, slab-serif, monospace and quasi‑proportional typeface family
cask "font-iosevka"
# Sans-serif, slab-serif, monospace and quasi‑proportional typeface family
cask "font-iosevka-aile"
# Sans-serif, slab-serif, monospace and quasi‑proportional typeface family
cask "font-iosevka-etoile"
# Typeface made for developers
cask "font-jetbrains-mono"
# Developer targeted fonts with a high number of glyphs
cask "font-jetbrains-mono-nerd-font"
# Font manager
cask "fontbase"
# GIT client
cask "fork"
# Finder replacement and FTP, SFTP, WebDAV and Amazon s3 client
cask "forklift"
# Game client
cask "gog-galaxy"
# Web browser
cask "google-chrome"
# Web browser
cask "google-chrome-dev"
# Tool to set light or dark appearance on a per-app basis
cask "gray"
# Desktop automation application
cask "hammerspoon"
# Open-source video transcoder
cask "handbrake"
# Menu bar application that displays the CPU speed limit due to thermal issues
cask "hot"
# Free and open-source media player
cask "iina"
# Tool to optimize images to a smaller size
cask "imageoptim"
# HTTP and GraphQL Client
cask "insomnia"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Extensible editor for OpenStreetMap
cask "josm"
# Keyboard customizer
cask "karabiner-elements"
# File archiver
cask "keka"
# GPU-based terminal emulator
cask "kitty"
# WordPress local development tool by Flywheel
cask "local"
# File system integration
cask "macfuse"
# Controls and monitors all fans on Apple computers
cask "macs-fan-control"
# Shows the next meeting in the menu bar
cask "meetingbar"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Utility to move and zoom windows—on one display
cask "moom"
# Smooths scrolling and set mouse scroll directions independently
cask "mos"
# VPN client
cask "mullvadvpn"
# Music tagger
cask "musicbrainz-picard"
# Multi-file renaming tool
cask "name-mangler"
# Utility to toggle dark mode
cask "nightowl"
# App to write, plan, collaborate, and get organized
cask "notion"
# Cloud gaming platform
cask "nvidia-geforce-now"
# Open-source software for live streaming and screen recording
cask "obs"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Finds large, unwanted files and deletes them
cask "omnidisksweeper"
# Verify system files structure, run miscellaneous maintenance and more
cask "onyx"
# Open links/files with specific browsers/apps
cask "openin"
# WebKit based web browser
cask "orion"
# Podcast platform
cask "pocket-casts"
# Collaboration platform for API development
cask "postman"
# Graphical user interface for the 'defaults' command
cask "prefs-editor"
# Web development companion
cask "prepros"
# HTTP debugging proxy
cask "proxyman"
# Peer to peer Bitorrent client
cask "qbittorrent"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# JavaScript playground that auto-evaluates as code is typed
cask "runjs"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# Displays all open files and sockets in use by all running processes
cask "sloth"
# Visualisation, analysis, and annotation of music audio recordings
cask "sonic-visualiser"
# File sharing network
cask "soulseek"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Git client
cask "sublime-merge"
# Text editor for code, markup and prose
cask "sublime-text"
# Subtitle speech synchronizer
cask "subsync"
# Replacement for RCDefaultApps, written in Swift
cask "swiftdefaultappsprefpane"
# Real time file synchronization software
cask "syncthing"
# Quicklook extension for source files
cask "syntax-highlight"
# Native GUI tool for relational databases
cask "tableplus"
# Messaging app with a focus on speed and security
cask "telegram"
# Utility to change the default backup interval of Time Machine
cask "timemachineeditor"
# To-do list
cask "todoist"
# Tool to automate the insertion of frequently used text and graphics
cask "typinator"
# Virtual machines UI using QEMU
cask "utm"
# Disk encryption software focusing on security based on TrueCrypt
cask "veracrypt"
# Multimedia player
cask "vlc"
# Music player for high resoluion (Hi-Res) music through the external sources
cask "vox"
# Rust-based terminal
cask "warp"
# Desktop client for WhatsApp
cask "whatsapp"
# Video communication and virtual meeting platform
cask "zoom"
mas "Amphetamine", id: 937984704
mas "Baby Monitor 3G", id: 626137367
mas "Brightly", id: 1560229265
mas "ColorSlurp", id: 1287239339
mas "Craft", id: 1487937127
mas "Day One", id: 1055511498
mas "Drafts", id: 1435957248
mas "GarageBand", id: 682658836
mas "HazeOver", id: 430798174
mas "iMovie", id: 408981434
mas "Infuse", id: 1136220934
mas "Jiffy", id: 1502527999
mas "Keynote", id: 409183694
mas "LanguageTool", id: 1534275760
mas "MenubarX", id: 1575588022
mas "Numbers", id: 409203825
mas "One Thing", id: 1604176982
mas "OpenIn", id: 1547147101
mas "Pages", id: 409201541
mas "Pandan", id: 1569600264
mas "Recordia", id: 1529006487
mas "Reeder", id: 1529448980
mas "Reeder", id: 1449412482
mas "SomaFM", id: 449155338
mas "Spark", id: 1176895641
mas "Tadam", id: 531349534
mas "Tailscale", id: 1475387142
mas "Twingate", id: 1501592214
mas "UTC Time", id: 1538245904
mas "Velja", id: 1607635845
mas "Yoink", id: 457622435
