# Plugin manager for zsh, inspired by antigen and antibody
brew "antidote"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Play, record, convert, and stream many audio and video codecs
brew "ffmpeg-full"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Tools and libraries to manipulate images in many formats
brew "imagemagick-full"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Pager program similar to more
brew "less"
# Mac App Store command-line interface
brew "mas"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Deep clean and optimize your Mac
brew "mole"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Upgrade all the things
brew "topgrade"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Enable Windows-like alt-tab
cask "alt-tab"
# Display management tool
cask "betterdisplay"
# Utility improving 3rd party mouse performance and functionalities
cask "bettermouse"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Screen capturing tool
cask "cleanshot"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# OpenAI's Codex desktop app for managing coding agents
cask "codex-app"
# Multi-platform client-side cloud file encryption tool
cask "cryptomator"
# Disk space visualiser
cask "daisydisk"
# API documentation browser and code snippet manager
cask "dash"
# Voice and text chat software
cask "discord"
# Downloads videos from different websites
cask "downie"
# Web browser
cask "firefox@developer-edition"
cask "font-maple-mono"
cask "font-maple-mono-nf"
# Convert RAW images captured with Fujifilm cameras
cask "fujifilm-x-raw-studio"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome@beta"
# Desktop automation application
cask "hammerspoon"
# Automated organisation
cask "hazel"
# Free and open-source media player
cask "iina"
# Tool to optimise images to a smaller size
cask "imageoptim"
# Keyboard customiser
cask "karabiner-elements"
# File archiver
cask "keka"
# Automation software
cask "keyboard-maestro"
# Free and open-source media player
cask "kodi"
# Utility to move and zoom windows—on one display
cask "moom"
# VPN client
cask "mullvad-vpn"
# App to write, plan, collaborate, and get organised
cask "notion"
# Cloud gaming platform
cask "nvidia-geforce-now"
# Converts and edits video, audio or image files
cask "permute"
# HTTP debugging proxy
cask "proxyman"
# Control your tools with a few keystrokes
cask "raycast"
# AI-powered writing assistant
cask "rewritebar"
# Emoji picker optimised for blind people
cask "rocket"
# Instant messaging application focusing on security
cask "signal"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Native GUI tool for relational databases
cask "tableplus"
# Mesh VPN based on WireGuard
cask "tailscale-app"
# Messaging app with a focus on speed and security
cask "telegram"
# Open-source BitTorrent client
cask "transmission"
# Open-source code editor
cask "visual-studio-code"
# Native desktop client for WhatsApp
cask "whatsapp"
# Multiplayer code editor
cask "zed"
mas "1Password for Safari", id: 1569813296
mas "Dato", id: 1470584107
mas "HazeOver", id: 430798174
mas "Hyperduck", id: 6444667067
mas "Infuse", id: 1136220934
mas "Things", id: 904280696
mas "Velja", id: 1607635845
vscode "adpyke.codesnap"
vscode "akamud.vscode-theme-onelight"
vscode "alefragnani.bookmarks"
vscode "alex-c.code-canvas-app"
vscode "ambar.bundle-size"
vscode "anotherglitchinthematrix.monochrome"
vscode "antfu.file-nesting"
vscode "antfu.theme-vitesse"
vscode "anthonyattard.zoomer"
vscode "anthropic.claude-code"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "astro-build.astro-vscode"
vscode "asvetliakov.vscode-neovim"
vscode "azemoh.one-monokai"
vscode "beardedbear.beardedicons"
vscode "beardedbear.beardedtheme"
vscode "bierner.docs-view"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "bradlc.vscode-tailwindcss"
vscode "britesnow.vscode-toggle-quotes"
vscode "catppuccin.catppuccin-vsc"
vscode "chouzz.vscode-better-align"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "clinyong.vscode-css-modules"
vscode "codezombiech.gitignore"
vscode "danvk.any-xray"
vscode "davidanson.vscode-markdownlint"
vscode "davidlday.languagetool-linter"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-dash"
vscode "dkundel.vscode-new-file"
vscode "docker.docker"
vscode "drcika.apc-extension"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "emilast.logfilehighlighter"
vscode "esbenp.prettier-vscode"
vscode "eseom.nunjucks-template"
vscode "fabiospampinato.vscode-open-multiple-files"
vscode "felipecaputo.git-project-manager"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "firsttris.vscode-jest-runner"
vscode "formulahendry.auto-rename-tag"
vscode "github.codespaces"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "hediet.debug-visualizer"
vscode "humao.rest-client"
vscode "huytd.quantumfox"
vscode "hyzeta.vscode-theme-github-light"
vscode "imagio.vscode-dimmer-block"
vscode "ipatalas.vscode-postfix-ts"
vscode "jakewilson.vscode-placeholder-images"
vscode "janisdd.vscode-edit-csv"
vscode "jdinhlife.gruvbox"
vscode "jock.svg"
vscode "johnpapa.vscode-peacock"
vscode "kelvin.vscode-sshfs"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "mariusschulz.yarn-lock-syntax"
vscode "mechatroner.rainbow-csv"
vscode "meganrogge.template-string-converter"
vscode "mhutchie.git-graph"
vscode "miguelsolorio.fluent-icons"
vscode "miguelsolorio.min-theme"
vscode "mikestead.dotenv"
vscode "million.million-lint"
vscode "monokai.theme-monokai-pro-vscode"
vscode "moshfeu.compare-folders"
vscode "mrmlnc.vscode-duplicate"
vscode "mrmlnc.vscode-scss"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.copilot-mermaid-diagram"
vscode "ms-vscode.js-debug-nightly"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.sublime-keybindings"
vscode "ms-vscode.vscode-commander"
vscode "ms-vscode.vscode-copilot-data-analysis"
vscode "ms-vscode.vscode-copilot-vision"
vscode "ms-vscode.vscode-js-profile-flame"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vscode.vscode-websearchforcopilot"
vscode "ms-vsliveshare.vsliveshare"
vscode "mxsdev.typescript-explorer"
vscode "mylesmurphy.prettify-ts"
vscode "naumovs.color-highlight"
vscode "nicoespeon.abracadabra"
vscode "nidu.copy-json-path"
vscode "nmsmith89.incrementor"
vscode "oouo-diogo-perdigao.docthis"
vscode "paulshen.paul-typescript-toolkit"
vscode "penumbratheme.penumbra"
vscode "pflannery.vscode-versionlens"
vscode "pkief.material-product-icons"
vscode "quick-lint.quick-lint-js"
vscode "quicktype.quicktype"
vscode "qwtel.sqlite-viewer"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "ritwickdey.liveserver"
vscode "ryu1kn.partial-diff"
vscode "sammcleod.ghostty-config-syntax"
vscode "sburg.vscode-javascript-booster"
vscode "semanticdiff.semanticdiff"
vscode "sleistner.vscode-fileutils"
vscode "stackbreak.comment-divider"
vscode "styled-components.vscode-styled-components"
vscode "stylelint.vscode-stylelint"
vscode "sumneko.lua"
vscode "syler.sass-indented"
vscode "tamasfe.even-better-toml"
vscode "teabyii.ayu"
vscode "timonwong.shellcheck"
vscode "tyriar.sort-lines"
vscode "unifiedjs.vscode-mdx"
vscode "upstash.context7-mcp"
vscode "usernamehw.errorlens"
vscode "virgilsisoe.hammerspoon"
vscode "vitest.explorer"
vscode "vscjava.vscode-gradle"
vscode "webpro.vscode-knip"
vscode "wesbos.theme-cobalt2"
vscode "whizkydee.material-palenight-theme"
vscode "wix.glean"
vscode "wmaurer.change-case"
vscode "wooodhead.vscode-wrap-console-log-simple"
vscode "xabikos.javascriptsnippets"
vscode "yinfei.luahelper"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
